README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-20 Sat 15:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Automarker</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marcus Vinicius dos Santos" />
</head>
<body>
<div id="content">
<h1 class="title">Automarker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4937a3c">1. Dependencies</a></li>
<li><a href="#org94d0549">2. Installation (on a Mac)</a></li>
<li><a href="#org499e3bb">3. Usage</a>
<ul>
<li><a href="#orga69b104">3.1. Marking</a>
<ul>
<li><a href="#org4a7211d">3.1.1. Preamble</a></li>
<li><a href="#org0ef4c7c">3.1.2. Steps</a></li>
</ul>
</li>
<li><a href="#orgd40c903">3.2. Output</a></li>
<li><a href="#org264a1d0">3.3. Test cases</a></li>
<li><a href="#org6c79f43">3.4. Other functions</a></li>
</ul>
</li>
<li><a href="#org93ab9ad">4. License and Credits</a></li>
</ul>
</div>
</div>
<p>
AUTOMARKER is an automated marker for lisp program assignments where
the students' assignment solutions have been exported from D2L.
</p>

<div id="outline-container-org4937a3c" class="outline-2">
<h2 id="org4937a3c"><span class="section-number-2">1.</span> Dependencies</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Portacle (<a href="https://portacle.github.io/">https://portacle.github.io/</a>) is a complete plug-and-play IDE for Common Lisp. It contains the following goodies:
<ul class="org-ul">
<li>Emacs: <a href="https://www.gnu.org/software/emacs/download.html">https://www.gnu.org/software/emacs/download.html</a></li>
<li>Steel Bank Common Lisp (SBCL): <a href="http://www.sbcl.org/getting.html">http://www.sbcl.org/getting.html</a></li>
<li>Quicklisp: <a href="https://www.quicklisp.org/beta/#installation">https://www.quicklisp.org/beta/#installation</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org94d0549" class="outline-2">
<h2 id="org94d0549"><span class="section-number-2">2.</span> Installation (on a Mac)</h2>
<div class="outline-text-2" id="text-2">
<p>
Clone this repository in your Quicklisp's <code>projects</code> directory on Portacle:
</p>
<div class="org-src-container">
<pre class="src src-shell">$ cd /Applications/portacle/projects/
$ git clone https://github.com/marcus3santos/automarker.git  
</pre>
</div>
</div>
</div>

<div id="outline-container-org499e3bb" class="outline-2">
<h2 id="org499e3bb"><span class="section-number-2">3.</span> Usage</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga69b104" class="outline-3">
<h3 id="orga69b104"><span class="section-number-3">3.1.</span> Marking</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org4a7211d" class="outline-4">
<h4 id="org4a7211d"><span class="section-number-4">3.1.1.</span> Preamble</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
To mark an assignment, the automarker needs the following files:
</p>
<ul class="org-ul">
<li>a folder or a zip file exported by D2L containing the files submitted by the students</li>
<li>the D2L exported assignment grades CSV file</li>
<li>the test cases lisp file for the particular assignment you want to mark</li>
</ul>
</div>
</div>

<div id="outline-container-org0ef4c7c" class="outline-4">
<h4 id="org0ef4c7c"><span class="section-number-4">3.1.2.</span> Steps</h4>
<div class="outline-text-4" id="text-3-1-2">
<ol class="org-ol">
<li><p>
On D2L, export the grades (as a CSV file) for the particular
assignment you want to mark. When generating this file, select the
following <i>Export Options</i> on D2L:
</p>
<ul class="org-ul">
<li>Username</li>
<li>Points grade</li>
<li>Last name</li>
<li>First name</li>
</ul>
<p>
Below is an example of a CSV file exported by D2L:
</p>
<pre class="example" id="org368964e">
Username,Last Name,First Name,Lab 0X Points Grade &lt;Course  Data&gt;,End-of-Line-Indicator 
#TTiger,Tigertongue,Tim,,#
#Patrick97,Pearson,Patrick,,#
#Towhander,Twohands,Tony,,#
#Zain1997,Zodson,Zain,,#
#Coopercat,Cooper,Cain,,#
#Hammermann,Odinson,Thor,,#
#CastleSword03,Vampireson,Alucard,,#
#TarkovIsAwesone,Handerson,Timb,,#
</pre></li>
<li>Launch Portacle by double clicking on the portacle app.</li>
<li><p>
To load the automarker, type the following commands on the REPL:
</p>
<div class="org-src-container">
<pre class="src src-lisp">CL-USER&gt; (ql:quickload <span style="color: #8d9fa1; font-weight: bold;">:automarker</span>)
CL-USER&gt; (<span style="color: #93a61a; font-weight: bold;">in-package</span> <span style="color: #8d9fa1; font-weight: bold;">:automarker</span>)
AUTOMARKER&gt; 
</pre>
</div></li>
<li><p>
To invoke the automarker to mark the students' assignment solutions, type the command below on the REPL:
</p>
<div class="org-src-container">
<pre class="src src-lisp">AUTOMARKER&gt; (automark submissions is-zipped grades-export-file test-cases-file results due-datetime weights)
</pre>
</div>
<p>
where:
</p>
<ul class="org-ul">
<li><code>submissions</code> is a string representing the full path the folder
or zip file exported by D2L containing the files submitted by the
students.</li>
<li><code>is-zipped</code> is a boolean (i.e., it can be the lisp constants <code>T</code>
or <code>NIL</code>) that informs whether <code>submissions</code> is a folder or a zip
file. Put <code>T</code> if <code>submissions</code> is a zip file and <code>NIL</code> if it is
just a regular folder.</li>
<li><code>grades-export-file</code> is a string representing the full path for
the D2L assignment grades exported by D2L</li>
</ul>
<ul class="org-ul">
<li><code>test-cases-file</code> is a string representing the full path for the test cases lisp file.</li>
<li><code>results</code> is a string representing the full path for a folder
where you want automarker to store the results (the students'
marks and log files). For example, if you provide the path
"<i>Users/johndoe/A1</i>" , the automarker will create its
files/subfolders inside folder <code>/Users/johndoe/A1/</code>.</li>
<li><p>
<code>due-datetime</code> is a list representing the date and time the
assignment is due, formatted as follows <code>'(&lt;MMM&gt; &lt;DD&gt; &lt;HHMM&gt;
    &lt;PP&gt;)</code>, where <code>&lt;MMM&gt;</code> are the three first letters of the name of
the month (in upper or lower case), e.g., sep, <code>&lt;DD&gt;</code> is a number
representing the month, e.g., 3 (or 03), <code>&lt;HHMM&gt;</code> is a number with
at most four digits representing the time, 2 digits for the hour,
and 2 digits for minutes, e.g., 0145, and <code>&lt;PP&gt;</code> is either <code>am</code> or
<code>pm</code>. Here are examples of valid due dates:
</p>
<pre class="example" id="org84be287">
'(sep 1 0100 pm)
'(oct 23 1200 pm)
'(Dec 11 1200 pm)
</pre></li>
<li><code>weights</code> (optional) is either <code>NIL</code> or a list of pairs
<code>(&lt;function-name&gt; &lt;weight&gt;)</code>, where: <code>&lt;function-name&gt;</code> is the name
of the test function defined in the unit test, and <code>&lt;weight&gt;</code> is a
number from [0, 100] representing the weight of that function in
the calculation of the total mark. Note: the sum of weight values
has to be equal to 100. If weights is not provided, then the
tested functions have equal weight, and the total mark is
calculated by dividing the number of correct results by the total
number of test cases and multiplying the result by 100.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd40c903" class="outline-3">
<h3 id="orgd40c903"><span class="section-number-3">3.2.</span> Output</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The log file <code>log.txt</code>, created in the automarker's root folder,
contains historical information about the evaluation of students'
assignments and the generation of the respective grades spreadsheet
file.
</p>

<p>
The automarker generates three other files as the result of marking
the students' assignments:
</p>

<ul class="org-ul">
<li><p>
A csv spreadsheet file called <code>grades.csv</code> containing the students' assignment marks. This is a D2L-importable grades file and it is created based on the <code>grades-export-file</code> provided by the user (see item 2 above). Below is an examples of such file::
</p>
<pre class="example" id="org7eec765">
Username,Last Name,First Name,Lab 0X Points Grade &lt;Course Data&gt;,End-of-Line-Indicator
#TTiger,Tigertongue,Tim,100.0,# 
#Patrick97,Pearson,Patrick,72.5,#
#Towhander,Twohands,Tony,100.0,#
#Zain1997,Zodson,Zain,95.5,#
#Coopercat,Cooper,Cain,100.0,#
#Hammermann,Odinson,Thor,0.0,#
</pre>
<p>
Note:
</p>
<ul class="org-ul">
<li>If a student exists in the grades export but not in the
submissions folder, then the grade in the <code>grades.csv</code> file will
not be included in the generated <code>grades.csv file</code> .</li>
</ul></li>
<li><p>
A Feedback folder that holds feedback files for the students. The
general structure is like this: Consider Timb Handerson who did not
get a full grade. His feedback file will be as such:
</p>
<pre class="example" id="orgf1667de">
Feedback on your assignment solution

Unit test results:

((Pass TEST-DEPOSIT (EQUAL (DEPOSIT 20) 130))
 (Pass TEST-DEPOSIT (EQUAL (DEPOSIT 10) 110))
 (Pass TEST-DEPOSIT (NOT (DEPOSIT 10001)))
 (Fail TEST-WITHDRAW (EQUAL (WITHDRAW 60) 10))
 (Pass TEST-WITHDRAW (NOT (WITHDRAW 80)))
 (Pass TEST-WITHDRAW (NOT (WITHDRAW 10001)))
 (Fail TEST-WITHDRAW (EQUAL (WITHDRAW 20) 70))
 (Fail TEST-WITHDRAW (EQUAL (WITHDRAW 10) 90)))
</pre></li>
<li>A zipped version of the feedback folder. To be uploaded into D2L.</li>
</ul>
</div>
</div>

<div id="outline-container-org264a1d0" class="outline-3">
<h3 id="org264a1d0"><span class="section-number-3">3.3.</span> Test cases</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Test cases must follow a specific format in order to be used within
the automarker.  As an example, suppose the assignment requires the
students to submit a file that includes two functions: a <code>fact</code>
function that gives the factorial of a number, and a <code>avg</code> function
that gives the average of a list of numbers. Then, the test cases lisp
file will be something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(deftest test-fact ()
  <span style="color: #62787f;">;; </span><span style="color: #62787f;">Include any global variable declarations here</span>
  (check
    (equal (fact 5) 120)
    (equal (fact 6) 720)
    (equal (fact 7) 5040)

(deftest test-avg ()
  <span style="color: #62787f;">;; </span><span style="color: #62787f;">Include any global variable declarations here</span>
  (check
    (equal (avg '(5 8 10 2 12)) 7.4)
    (equal (avg '(0 0 0 0 0 0)) 0)
    (equal (avg '(1 2 0)) 1)

(<span style="color: #93a61a; font-weight: bold;">defun</span> <span style="color: #3c98e0;">unit-test</span> ()
  <span style="color: #3cafa5;">"Calls the test cases and 'forgets' the functions that were tested."</span>
  (test-fact)
  (fmakunbound 'fact) <span style="color: #62787f;">; Removes the function definition from the global environment,</span>
                      <span style="color: #62787f;">; so the next time around the unit test is done on a freshly loaded version of this function.</span>
  (test-avg)
  (fmakunbound 'avg))

(unit-test) 
</pre>
</div>
<p>
Notice that it is still possible to include more complex forms of
tests, but the general idea is to create assertions (e.g., ~(check
(equal &#x2026; &#x2026;) &#x2026; ~) that call the function being tested and check
if returns the expected value defined in the assertions.
</p>

<p>
If you wish to make test cases that do not utilize <code>equal</code>, then just
make sure that a <code>t</code> or <code>NIL</code> is returned by the assertion.
</p>

<p>
Any errors that the student's solution could raise during runtime will
be handled by the automarker and reported as appropriate.
</p>
</div>
</div>

<div id="outline-container-org6c79f43" class="outline-3">
<h3 id="org6c79f43"><span class="section-number-3">3.4.</span> Other functions</h3>
<div class="outline-text-3" id="text-3-4">
<p>
In case you wish to mark one specific submission or test your test
case file, you can use the following function:
</p>
<pre class="example" id="orge2010d5">
mark-std-solution (student-solution test-cases-dir)
---------------------------------------------------
Description:  Loads the student-solution file, loads the test cases, runs
              the test cases, and returns the percentage of correct results over total results

Inputs:       1) student-solution [string]: The directory for the solution of the student.
              2) test-cases-dir [string]: The directory for the test cases file. This will be used to test the solution of the students for the current assignment.

Outputs:      [list] A list of the following:
              1) [string] The grade of the student.
              2) [string] A comment that describes if there was a runtime error while loading the student submission or not
              3) [string] A description of what happened during runtime (from exceptions to conditions to whatever) 
              4) [list] The results of marking each of the test cases.

Side-effects: This function utilizes the global variable *results* while running. In the beginning by reseting it to nil, and at the end by updating it with the current
              student's submission results.
---------------------------------------------------
</pre>

<p>
Usage Example: Say there was a student that you want to mark their
submissions independantly from the other students. You can simply take
their lisp submission file, say <code>"/home/John/mysol.lisp"</code> , and the
test cases lisp file "/home/john/test-cases.lisp"~. You would use the
automarker as follows: (assuming you have already installed automarker
as shown above)
</p>
<div class="org-src-container">
<pre class="src src-lisp">CL-USER&gt; (ql:quickload <span style="color: #8d9fa1; font-weight: bold;">:automarker</span>)  <span style="color: #62787f;">; Loading the automarker</span>
CL-USER&gt; (<span style="color: #93a61a; font-weight: bold;">in-package</span> <span style="color: #8d9fa1; font-weight: bold;">:automarker</span>) <span style="color: #62787f;">; becoming the automarker package</span>
AUTOMARKER&gt; (mark-std-solution <span style="color: #3cafa5;">"/home/John/mysol.lisp"</span> <span style="color: #3cafa5;">"/home/John/test-cases.lisp"</span>) 
(<span style="color: #3cafa5;">"100.0"</span> OK <span style="color: #3cafa5;">"No runtime errors"</span>
 ((<span style="color: #3cafa5;">"Pass"</span> T TEST-DEPOSIT (EQUAL (DEPOSIT 20) 130))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-DEPOSIT (EQUAL (DEPOSIT 10) 110))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-DEPOSIT (NOT (DEPOSIT 10001)))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-WITHDRAW (EQUAL (WITHDRAW 60) 10))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-WITHDRAW (NOT (WITHDRAW 80)))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-WITHDRAW (NOT (WITHDRAW 10001)))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-WITHDRAW (EQUAL (WITHDRAW 20) 70))
  (<span style="color: #3cafa5;">"Pass"</span> T TEST-WITHDRAW (EQUAL (WITHDRAW 10) 90)))) <span style="color: #db5823; font-weight: bold;">AUTOMARKER&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org93ab9ad" class="outline-2">
<h2 id="org93ab9ad"><span class="section-number-2">4.</span> License and Credits</h2>
<div class="outline-text-2" id="text-4">
<p>
See LICENSE for usage permissions. See AUTHORS for credits.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus Vinicius dos Santos</p>
<p class="date">Created: 2022-08-20 Sat 15:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
